mypass/src/Documents/ЭкземплярДоступа/ЭкземплярДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭкземплярДоступа</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.МоиПароли</registerRecords>
  <attributes>
    <name>ВидДанных</name>
    <type>
      <types>CatalogRef.ВидыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДанных</name>
    <type>
      <types>EnumRef.СтатусыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДанных</name>
    <type>
      <types>CatalogRef.ГруппыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассДанных</name>
    <type>
      <types>EnumRef.КлассыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрисоединенныеФайлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

mypass/src/InformationRegisters/МоиПароли/МоиПароли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МоиПароли</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.СвойстваВидовДанных</types>
    </type>
  </resources>
  <attributes>
    <name>СтатусДанных</name>
    <type>
      <types>EnumRef.СтатусыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДанных</name>
    <type>
      <types>CatalogRef.ГруппыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассДанных</name>
    <type>
      <types>EnumRef.КлассыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЭкземплярДоступа</name>
    <type>
      <types>DocumentRef.ЭкземплярДоступа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДанных</name>
    <type>
      <types>CatalogRef.ВидыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваВидовДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

mypass/src/Enums/СтатусыДанных/СтатусыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДанных</name>
  <enumValues>
    <name>Актуальный</name>
  </enumValues>
  <enumValues>
    <name>Неактуальный</name>
  </enumValues>
</mdclass:Enum>

mypass/src/ChartsOfCharacteristicTypes/СвойстваВидовДанных/СвойстваВидовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СвойстваВидовДанных</name>
  <type>
    <types>CatalogRef.ДополнительныеСвойства</types>
    <types>EnumRef.СтатусыДанных</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.Пользователи</types>
    <types>DocumentRef.ЭкземплярДоступа</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>250</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>ДатаИзменения_ИзРегистраСведений</name>
      <description>Дата записи</description>
      <code>10002</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>Комментарий_ИзРегистраСведений</name>
      <description>Комментарий</description>
      <code>10001</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>СтатусДанных_ИзРегистраСведений</name>
      <description>Статус</description>
      <code>10003</code>
      <type>
        <types>EnumRef.СтатусыДанных</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>РежимПароля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Открывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Генератор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

mypass/src/Documents/ЭкземплярДоступа/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	СтатусДанных = Перечисления.СтатусыДанных.Актуальный;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		СтатусДанных = Перечисления.СтатусыДанных.Неактуальный;
	Иначе
		СтатусДанных = Перечисления.СтатусыДанных.Актуальный;
	КонецЕсли;
	
	МоиПаролиСервер.ПередЗаписьюДокументы(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ И НЕ ДополнительныеСвойства.Свойство("НеЗаписыватьСтатусВРегистрСведений") Тогда
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.МоиПароли");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ЭкземплярДоступа", Ссылка);
		Блокировка.Заблокировать();
		
		// Подготовим набор записей
		НаборЗаписей = РегистрыСведений.МоиПароли.СоздатьНаборЗаписей();
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		
		ЗаписиДляУдаления = Новый Массив; // Массив из РегистрСведенийЗапись
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если ПометкаУдаления Тогда
				Запись.СтатусДанных = Перечисления.СтатусыДанных.Неактуальный;
			Иначе
				Запись.СтатусДанных = Перечисления.СтатусыДанных.Актуальный;
			КонецЕсли;
			Если НЕ Запись.КлассДанных = КлассДанных ИЛИ НЕ Запись.ГруппаДанных = ГруппаДанных ИЛИ НЕ Запись.ВидДанных = ВидДанных Тогда
				ЗаписиДляУдаления.Добавить(Запись);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЗаписьДляУдаления Из ЗаписиДляУдаления Цикл
			НаборЗаписей.Удалить(ЗаписьДляУдаления);
		КонецЦикла;
		
		// Запишем статус в регистр, если нужно
		НоваяСтрока = Неопределено;
		Для Каждого Строка Из НаборЗаписей Цикл
			Если Строка.Свойство = ПланыВидовХарактеристик.СвойстваВидовДанных.СтатусДанных_ИзРегистраСведений Тогда
				НоваяСтрока = Строка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НоваяСтрока = Неопределено Тогда
			НоваяСтрока = НаборЗаписей.Добавить();
		КонецЕсли;
		НоваяСтрока.Свойство      = ПланыВидовХарактеристик.СвойстваВидовДанных.СтатусДанных_ИзРегистраСведений;
		НоваяСтрока.Значение      = СтатусДанных;
		НоваяСтрока.ВидДанных     = ВидДанных;
		НоваяСтрока.ГруппаДанных     = ГруппаДанных;
		НоваяСтрока.КлассДанных = КлассДанных;
		НоваяСтрока.ЭкземплярДоступа        = Ссылка;
		НоваяСтрока.Комментарий   = Комментарий;
		НоваяСтрока.СтатусДанных  = СтатусДанных;
		НоваяСтрока.Регистратор   = Ссылка;
	
		НоваяСтрока = Неопределено;
		Для Каждого Строка Из НаборЗаписей Цикл
			Если Строка.Свойство = ПланыВидовХарактеристик.СвойстваВидовДанных.Комментарий_ИзРегистраСведений Тогда
				НоваяСтрока = Строка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НоваяСтрока = Неопределено Тогда
			НоваяСтрока = НаборЗаписей.Добавить();
		КонецЕсли;
		НоваяСтрока.Свойство      = ПланыВидовХарактеристик.СвойстваВидовДанных.Комментарий_ИзРегистраСведений;
		НоваяСтрока.Значение      = Комментарий;
		НоваяСтрока.ВидДанных     = ВидДанных;
		НоваяСтрока.ГруппаДанных     = ГруппаДанных;
		НоваяСтрока.КлассДанных = КлассДанных;
		НоваяСтрока.ЭкземплярДоступа        = Ссылка;
		НоваяСтрока.Комментарий   = Комментарий;
		НоваяСтрока.СтатусДанных  = СтатусДанных;
		НоваяСтрока.Регистратор   = Ссылка;
	
		НоваяСтрока = Неопределено;
		Для Каждого Строка Из НаборЗаписей Цикл
			Если Строка.Свойство = ПланыВидовХарактеристик.СвойстваВидовДанных.ДатаИзменения_ИзРегистраСведений Тогда
				НоваяСтрока = Строка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НоваяСтрока = Неопределено Тогда
			НоваяСтрока = НаборЗаписей.Добавить();
		КонецЕсли;
		НоваяСтрока.Свойство      = ПланыВидовХарактеристик.СвойстваВидовДанных.ДатаИзменения_ИзРегистраСведений;
		НоваяСтрока.Значение      = ТекущаяДатаСеанса();
		НоваяСтрока.ВидДанных     = ВидДанных;
		НоваяСтрока.ГруппаДанных     = ГруппаДанных;
		НоваяСтрока.КлассДанных = КлассДанных;
		НоваяСтрока.ЭкземплярДоступа        = Ссылка;
		НоваяСтрока.Комментарий   = Комментарий;
		НоваяСтрока.СтатусДанных  = СтатусДанных;
		НоваяСтрока.Регистратор   = Ссылка;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
